Revit 2027 API
BasicLossFactor Class
 This class encapsulates basic lighting loss factor calculation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LossFactor
 Autodesk.Revit.DB.Lighting.BasicLossFactor
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BasicLossFactor : LossFactor
Public Class BasicLossFactor
	Inherits LossFactor
public ref class BasicLossFactor : public LossFactor
type BasicLossFactor =
    class
        inherit LossFactor
    end
The BasicLossFactor type exposes the following members.
Constructors
Name | Description
BasicLossFactor() |  Creates a basic loss factor object with no loss.
BasicLossFactor(BasicLossFactor) |  Creates a copy of the given basic loss factor object
BasicLossFactor(Double) |  Creates a basic loss factor object with the given value.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from LossFactor)
LossFactor |  The loss factor.
LossFactorValue |  The calculated loss factor value
(Inherited from LossFactor)
Top
Methods
Name | Description
Clone |  Creates a copy of the LossFactor derived object.
(Inherited from LossFactor)
Dispose
(Inherited from LossFactor)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace